Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: །ངས་དང་པོ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་བར་དག་ཀྱང་ཡང་དག་པར་འཛིན་དུ་བཅུག་ཅིང་བཞག་སྟེ་རབ་ཏུ་གནས་པར་བྱས་སོ། །དེ་བཞིན་དུ་སྦྱར་ཏེ་ཤར་ཕྱོགས་ལོགས་ན་སངས་རྒྱས་ཀྱི་ཞིང་མངོན་པར་དགའ་བ་ཞེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པ་ཞེས་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་འཛམ་བུའི་ཆུ་ཀླུང་ཞེས་བྱ་བ་ན། དེ་བཞིན་གཤེགས་པ་ཉི་མའི་སྙིང་པོ་ཞེས་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་དགའ་བའི་དབང་ཕྱུག་ཅེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་དགའ་བའི་དབང་ཕྱུག་སྒྲ་དབྱངས་འོད་ཟེར་ཞེས་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཉི་མ་གནས་པ་ཞེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་ཉི་མ་ཞེས་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་རྒྱལ་བའི་གནས་རབ་ཅེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་འབྲུག་སྒྲ་བསྒྲགས་པ་ཞེས་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡང་དག་འཚོ་ཞེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་རྡོ་རྗེ་གྲགས་པ་ཞེས་བྱ་བ་དང་།
en: I was the one who made him for the first time obtain, enter, and remain in the perfection of generosity, and so on, up to and including the perfection of wisdom. “

source: སངས་རྒྱས་ཀྱི་ཞིང་ཤིན་ཏུ་རྡུལ་མེད་ཅེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་སྟག་གི་འོད་ཟེར་ཅེས་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་དགའ་མེད་ཅེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་ཉི་གདུགས་སྙིང་པོ་ཞེས་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་འཁོན་སྦྱོང་འོད་ཅེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་གྲགས་པའི་དབང་ཕྱུག་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ལྷུན་པོ་འོད་ཅེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་བསམ་ཡས་རྒྱལ་པོ་ཞེས་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ནམ་མཁའ་ཞེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་སྣང་དཔལ་སྙིང་པོ་ཞེས་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་མེ་ཏོག་འོད་ཅེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་འོད་གསལ་ཏོག་ཅེས་བྱ་བ་དང་།
en: In the same way I see, in the eastern direction, the buddha realm called Abhirati, in which there is the tathāgata named Akṣobhya; and the buddha realm Jambūnada, in which there is the tathāgata named Sūryagarbha; and the buddha realm Ratīśvara, in which there is the tathāgata named Ratīśvaraghoṣajyoti; and the buddha realm Sūryapratiṣṭhita, in which there is the tathāgata named Jñānabhāskara; and the buddha realm Jayavaiśraya, in which there is the tathāgata named Nāganinardita; and the buddha realm Saṃjīvana, in which there is the tathāgata named Vajrakīrti; and the buddha realm Svaraja, in which there is the tathāgata named Vyāghraraśmi; and the buddha realm Aratīya, in which there is the tathāgata named Saurabhyā Kiṃśukā; and the buddha realm Vairaprabha, in which there is the tathāgata named Kīrtīśvararāja; and the buddha realm Meruprabha, in which there is the tathāgata named Acintyarāja; and the buddha realm Saṃvara, in which there is the tathāgata named Jyotiśrīgarbha; and the buddha realm Kusumaprabha, in which there is the tathāgata named Prabhāketu; and the buddha realm Kṣamottara, in which there is the tathāgata named Merusvarasandarśanameru; and the buddha realm Dharaṇāvatī, in which there is the tathāgata named Jñānabimba; and the buddha realm Kusumavicitra, in which there is the tathāgata named Vimalanetra. “

source: སངས་རྒྱས་ཀྱི་ཞིང་བདེ་མཆོག་ཅེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་ལྷུན་དབྱངས་ལྷུན་པོ་ཡང་དག་སྟོན་ཅེས་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ས་ཅན་ཞེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་གཟུགས་ཞེས་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་མེ་ཏོག་སྣ་ཚོགས་ཞེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་དྲི་མེད་སྤྱན་ཞེས་བྱ་བ་དང་། རིགས་ཀྱི་བུ་དེ་དག་ལ་སོགས་པ་ཤར་ཕྱོགས་ལོགས་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དཔག་ཏུ་མེད་གྲངས་མེད་པ་དག་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་པ་དག་ཀྱང་ངས་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་གཟིགས་ཏེ།
en: Noble son, I see with my buddha eyes those bhagavat buddhas and countless, innumerable others who reside, live, and remain, teaching the Dharma in the eastern direction.

source: དེ་དག་སྔོན་བྱང་ཆུབ་ཏུ་སེམས་མ་བསྐྱེད་པ་ལས་ངས་དང་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་གོ། །སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་བར་དག་ཀྱང་ཡང་དག་པར་འཛིན་དུ་བཅུག་ཅིང་བཙུད་དེ་རབ་ཏུ་བཀོད་ནས།
en: In the past, when they had not developed the aspiration for enlightenment, I was the one who made them for the first time obtain the aspiration for the highest, most complete enlightenment, and to obtain, enter, and remain in the perfection of generosity, and so on, up to and including the perfection of wisdom.

source: ངས་དང་པོ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་པ་དག་གི་ཐད་དུ་ཕུལ་ནས། དེར་དེ་དག་ཐམས་ཅད་ཀྱིས་དང་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་ཐོབ་བོ།
en: First, I brought them before bhagavat buddhas, who resided, lived, and remained in those places, and there, for the first time, they obtained the prophecy of their attainment of the highest, most complete enlightenment.”

source: །དེ་ནས་དེའི་ཚེ་འཇིག་རྟེན་གྱི་ཁམས་མེ་ཏོག་ཀུན་ཏུ་རྒྱས་པ་ན་དེ་བཞིན་གཤེགས་པ་དྲི་མེད་གཟི་བརྗིད་ཡོན་ཏན་རྒྱལ་པོ་བཞུགས་པ་དེའི་གདན་རབ་ཏུ་གཡོས་སོ་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་འཁོད་པ་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པ་དྲི་མེད་གཟི་བརྗིད་ཡོན་ཏན་རྒྱལ་པོ་དེའི་གདན་རབ་ཏུ་གཡོས་པ་མཐོང་བ་དང་།
en: Then, at that time, in the Saṃpuṣpita realm, the seat on which the Tathāgata Vimalateja­guṇa­rāja sat shook. The bodhisattvas who were present there saw the Tathāgata Vimalateja­guṇa­rāja’s seat shake.

source: དེ་བཞིན་གཤེགས་པ་དེ་ཉིད་ལ་ཞུས་པ། བཅོམ་ལྡན་འདས་སྔོན་མ་མཐོང་བ་བཅོམ་ལྡན་འདས་ཀྱི་གདན་རབ་ཏུ་གཡོས་པ་འདིའི་རྒྱུ་ནི་གང་ལགས། རྐྱེན་ནི་གང་ལགས།
en: They asked the Tathāgata, “Bhagavat, what was the cause and what were the circumstances that made the Bhagavat’s seat shake, which we have never seen happen before?”

source: དེ་བཞིན་གཤེགས་པ་དེས་དེ་དག་ལ་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དག་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་ནུབ་ཕྱོགས་ཀྱི་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་ས་ཡ་ཕྲག་དགུ་དང་ཆིག་འབུམ་འདས་པ་ན། འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་ཅེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: The Tathāgata said to them, “Noble sons, in the western direction from this buddha realm, beyond 9,100,000 buddha realms, there is the Sahā realm.

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བ་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་པ་དེ་ད་ལྟར་འཁོར་བཞི་པོ་རྣམས་ལ་སྔོན་གྱི་ཚུལ་ལས་བརྩམས་ཏེ་ཆོས་སྟོན་ཏོ།
en: The tathāgata named Śākyamuni resides, lives, and remains there. He is now teaching the Dharma to his fourfold assembly, beginning with an account of the past.

source: །དེ་བཞིན་གཤེགས་པ་དེ་སྔོན་བྱང་ཆུབ་སེམས་དཔར་གྱུར་ཅིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་སྤྱད་པ་སྤྱོད་པ་ན་དེས་ང་དང་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་སྟེ།
en: In the past, that tathāgata, when he was a bodhisattva and performing bodhisattva conduct in order to attain the highest, most complete enlightenment, made me aspire for the first time to the highest, most complete enlightenment.

source: གང་གིས་ང་དང་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པའི་དེ་བཞིན་གཤེགས་པ་དེས་ང་དང་པོ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་བར་དག་ཀྱང་ཡང་དག་པར་འཛིན་དུ་བཅུག་ཅིང་བཞག་སྟེ་རབ་ཏུ་གནས་པར་བྱས་སོ།
en: That tathāgata, who made me aspire for the first time to the highest, most complete enlightenment, also made me for the first time obtain, enter, and remain in the perfection of generosity, and so on, up to and including the perfection of wisdom.

source: །དེ་བཞིན་གཤེགས་པ་དེ་སྔོན་བྱང་ཆུབ་སེམས་དཔར་གྱུར་ཅིང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་དེས་ང་དང་པོ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་པ་དག་གི་ཐད་དུ་ཕུལ་ནས། དེར་ངས་དང་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་ཐོབ་སྟེ།
en: That tathāgata, when he was a bodhisattva and performing bodhisattva conduct in order to attain the highest, most complete enlightenment, brought me for the first time before a buddha, a bhagavat, who was present, existed, and lived there, and for the first time I received the prophecy of my attainment of the highest, most complete enlightenment.

source: ངའི་དགེ་བའི་བཤེས་གཉེན་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་ན་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་སོ།
en: That kalyāṇamitra of mine, the Tathāgata Śākyamuni, resides, lives, and remains in the Sahā realm.

source: །དེ་འཁོར་བཞི་པོ་རྣམས་ལ་སྔོན་གྱི་ཚུལ་དེ་ཉིད་ལས་བརྩམས་ཏེ་ཆོས་སྟོན་པས་ན།
en: He is teaching the Dharma to his fourfold assembly, beginning with an account of the past.

source: དེ་བཞིན་གཤེགས་པ་དེའི་བྱིན་གྱི་རླབས་དེས་ངའི་སྟན་རབ་ཏུ་གཡོས་སོ།
en: It is because of that tathāgata’s blessing that my seat shook. “

source: །རིགས་ཀྱི་བུ་དག་ཁྱེད་ཅག་ལས་ངའི་ཚིག་གིས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ལ་སྙུན་མི་མངའ་འམ། ཐུགས་བདེའམ་ཞེས་ཡོངས་སུ་དྲི་བའི་ཕྱིར་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་དུ་འགྲོ་བར་སྤྲོ་བ་སུ་ཡོད།
en: Noble sons, who among you wishes to go to the Sahā buddha realm to ask the Tathāgata Śākyamuni this question of mine: ‘Are you well? Are you at ease?’ ”

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་དྲི་མེད་གཟི་བརྗིད་ཡོན་ཏན་རྒྱལ་པོ་ལ་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་རྫུ་འཕྲུལ་དང་ལྡན་ཞིང་ཡོན་ཏན་ཐམས་ཅད་ཀྱི་ཕ་རོལ་ཏུ་སོན་པ་གང་དག་དེར་སྔ་དྲོའི་དུས་ཀྱི་ཚེ་སྣང་བ་ཆེན་པོ་མཐོང་ནས་རྣམ་པར་འཕྲུལ་པས་སངས་རྒྱས་ཀྱི་ཞིང་གཞན་དག་ནས་སངས་རྒྱས་ཀྱི་ཞིང་མེ་ཏོག་ཀུན་དུ་རྒྱས་པ་འདིར་ལྷགས་ཏེ།
en: Those bodhisattvas then said to the Tathāgata Vimalateja­guṇa­rāja, “Bhadanta Bhagavat, this morning bodhisattvas who had miraculous powers, the full attainment of all bodhisattva qualities, and had seen a great light, through their miraculous powers came from their buddha realms here to this buddha realm, Saṃpuṣpita.

source: དེས་དོག་ས་འདི་ཡང་ཡུད་ཙམ་ཞིག་བསྐྱོད་ཅིང་མེ་ཏོག་གི་ཆར་ཡང་རབ་ཏུ་ཕབ་པ་དེ་དག་ལགས་སོ།
en: Therefore, for a moment, the ground shook and a rain of flowers fell.”

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་གིས་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཅག་ཀྱང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་དེ་ལ་ཕྱག་བགྱི་བ་དང་། བསྙེན་བཀུར་བགྱི་བ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྣམ་པ་ལ་འཇུག་པའི་གཟུངས་ཀྱི་སྒོའི་ཆོས་ཀྱི་རྣམ་གྲངས་དེ་ཡང་མཉན་པའི་སླད་དུ་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་དེར་མཆིའོ་ཞེས་གསོལ་ནས།
en: And those bodhisattva mahāsattvas said, “Bhadanta Bhagavat, we are going to the Sahā buddha realm in order to pay homage to and honor the tathāgata arhat samyaksam­buddha Śākyamuni and to listen to the Dharma teaching on the dhāraṇī entranceway that is the form of omniscience.”

source: བྱང་ཆུབ་སེམས་དཔའ་འབུམ་ཕྲག་མང་པོ་དེ་དག་རང་རང་གི་རྫུ་འཕྲུལ་གྱི་མཐུས་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ནས་འཕགས་པ་དང་། དེ་དག་གིས་གང་ལོགས་སུ་བགྲོད་པར་བྱ་བ་མ་རྩོལ་ནས། ཡང་དེ་དག་གིས་གསོལ་པ།
en: Then hundreds of thousands of bodhisattvas, through their own miraculous powers, rose up above that buddha realm, but they did not make an effort to go anywhere.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཅག་གིས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་གང་ཕ་རོལ་ན་མཆིས་པའི་ཕྱོགས་དེས་ཡང་མ་འཚལ་ལགས་སོ།
en: They said, “Bhadanta Bhagavat, we do not know the direction of the Sahā buddha realm of the Tathāgata Śākyamuni.”

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པ་དྲི་མེད་གཟི་བརྗིད་ཡོན་ཏན་རྒྱལ་པོ་དེས་ཕྱག་བརྐྱང་སྟེ་སོར་མོ་ལྔ་ལས་འོད་ཟེར་སྣ་ཚོགས་དག་རབ་ཏུ་བཀྱེའོ། །དེ་ནས་འོད་ཟེར་དེ་དག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་ས་ཡ་ཕྲག་དགུ་དང་ཆིག་འབུམ་དག་སྣང་བར་བྱས་ཏེ།
en: The Tathāgata Vimalateja­guṇa­rāja then extended his hand and illuminated 9,100,000 buddha realms.

source: སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་འདིའི་བར་དུ་ཡང་སྣང་བར་བྱས་སོ།
en: He illuminated as far as this buddha realm, Sahā.

source: །དེས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་ཐམས་ཅད་དང་ལྡན་པའི་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་འདི་བྱང་ཆུབ་སེམས་དཔའ་དག་གིས་ཁྱབ་ཅིང་ནམ་མཁའི་ངོས་ཀྱང་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། ལྷ་མ་ཡིན་དག་གིས་ཁྱབ་པར་མཐོང་ངོ་།
en: Because of this the bodhisattvas could see this entire Sahā buddha realm filled with bodhisattvas and the sky filled with devas, nāgas, yakṣas, and asuras.

source: །མཐོང་ནས་ཀྱང་དེ་བཞིན་གཤེགས་པ་དྲི་མེད་གཟི་བརྗིད་ཡོན་ཏན་རྒྱལ་པོ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཅག་གིས་ཐམས་ཅད་དང་ལྡན་པའི་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་དེ་བྱང་ཆུབ་སེམས་དཔའ་དག་གིས་ཁྱབ་སྟེ་དེ་ན་གང་དུ་བྱང་ཆུབ་སེམས་དཔའ་དག་གིས་ཁྱབ་པར་མ་གྱུར་པའི་གོ་སྐབས་ནི་ཐ་ན་འཁར་བ་གཟུགས་པའི་གཏོས་ཙམ་ཡང་མ་མཆིས་པར་མཐོང་ལགས་སོ།། །།བམ་པོ་བཅྭ་ལྔ་པ་སྟེ་ཐ་མ།
en: When they had seen that, those bodhisattvas said to the Tathāgata Vimalateja­guṇa­rāja, “Bhadanta Bhagavat, we have seen that the entire Sahā buddha realm is filled with bodhisattvas, so that there isn’t even a space that’s only wide enough for a staff that hasn’t been filled by a bodhisattva.

source: དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ཡང་བདག་ཅག་ལ་གཟིགས་ཤིང་ཆོས་སྟོན་པར་མཐོང་ལགས་སོ།
en: We also saw the Tathāgata Śākyamuni teaching the Dharma and looking at us.”

source: །དེ་བཞིན་གཤེགས་པ་དྲི་མེད་གཟི་བརྗིད་ཡོན་ཏན་རྒྱལ་པོས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དག་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ནི་ཀུན་ཏུ་གཟིགས་པ་ཡིན་ཏེ།
en: The Tathāgata Vimalateja­guṇa­rāja said to the bodhisattvas, “Noble sons, the Tathāgata Śākyamuni is one who sees everything.

source: རིགས་ཀྱི་བུ་དག་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་ན་སེམས་ཅན་གང་སུ་དག་ས་ལ་གནས་པའམ། བར་སྣང་ལ་གནས་པ་དེ་དག་ལས་སེམས་ཅན་རེ་རེ་ཡང་འདི་སྙམ་དུ་སེམས་ཏེ། དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ནི་ཐུགས་ཐམས་ཅད་ཀྱིས་བདག་ལ་གཟིགས་ཤིང་། བདག་གཅིག་པུ་ལས་བརྩམས་ཏེ་ཆོས་སྟོན་ཏོ་སྙམ་དུ་སེམས་སོ།
en: Noble sons, in the Sahā buddha realm every being, whether he lives on the ground or lives in the sky, is thinking, ‘The Tathāgata Śākyamuni is looking at me with his whole mind, and he is teaching the Dharma to me alone.’

source: །རིགས་ཀྱི་བུ་དག་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ནི་ཁ་དོག་དང་དབྱིབས་གཅིག་གིས་ཀྱང་ཁ་དོག་དང་དབྱིབས་ཐམས་ཅད་དུ་ཆོས་སྟོན་པར་མཛད་དེ།
en: Noble sons, the Tathāgata Śākyamuni, who has one shape and color, teaches in all shapes and colors.

source: རིགས་ཀྱི་བུ་དག་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་སེམས་ཅན་གང་དག་ཚངས་པ་ལ་དད་པ་དེ་དག་གིས་ནི་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ཚངས་པར་ཡང་དག་པར་རྗེས་སུ་མཐོང་ཞིང་ཚངས་པའི་བདག་པོ་ཆེན་པོའི་སྒྲ་སྐད་ཀྱིས་ཆོས་ཐོས་སོ། །གང་དག་བདུད་ལ་དད་པ་རྣམས་དང་། གང་དག་ཉི་མ་ལ་དད་པ་རྣམས་དང་། གང་དག་ཟླ་བ་ལ་དད་པ་རྣམས་དང་། གང་དག་རྣམ་ཐོས་ཀྱི་བུ་ལ་དད་པ་རྣམས་དང་། གང་དག་འཕགས་སྐྱེས་པོ་ལ་དད་པ་རྣམས་དང་། གང་དག་མིག་མི་བཟང་ལ་དད་པ་རྣམས་དང་།
en: Noble sons, in that buddha realm those who have faith in Brahmā see the Tathāgata Śākyamuni as Brahmā and hear the Dharma being taught with the great Lord Brahmā’s voice.

source: གང་དག་ཡུལ་འཁོར་སྲུང་ལ་དད་པ་རྣམས་དང་། གང་དག་དབང་ཕྱུག་ཆེན་པོ་ལ་དད་པའི་བར་གྱི་སེམས་ཅན་དེ་དག་གིས་ནི་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དབང་ཕྱུག་ཆེན་པོའི་བར་གྱི་གཟུགས་དང་། ཁ་དོག་དང་། དབྱིབས་སུ་མཐོང་ཞིང་། དབང་ཕྱུག་ཆེན་པོའི་ཚིག་དང་སྒྲ་སྐད་ཀྱིས་ཆོས་ཐོས་སོ།
en: And it is the same for those who have faith in Māra, those who have faith in Sūrya, those who have faith in Candra, those who have faith in Vaiśravaṇa, those who have faith in Virūḍhaka, those who have faith in Virūpākṣa, those who have faith in Dhṛtarāṣṭra, and so on, up until those who have faith in Maheśvara seeing the Tathāgata Śākyamuni as having Maheśvara’s form, color, and shape, and hearing the Dharma being taught with Maheśvara’s words and voice.

source: །དེ་ན་ཁ་དོག་དང་། དབྱིབས་དང་། དད་པ་དང་། གཟུགས་དང་། སྒྲ་སྐད་བརྒྱད་ཁྲི་བཞི་སྟོང་གི་བར་དང་ལྡན་པའི་སེམས་ཅན་དེ་དག་གིས་ཀྱང་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་བཞིན་དུ་མཐོང་ཞིང་ཆོས་ཀྱང་ཐོས་སོ།
en: Beings who have 84,000 different kinds of colors, shapes, faiths, forms, and languages see the Tathāgata Śākyamuni in that way and listen to the Dharma from him.”

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པ་དྲི་མེད་གཟི་བརྗིད་ཡོན་ཏན་རྒྱལ་པོས་འཁོར་དེའི་བྱང་ཆུབ་སེམས་དཔའ་གསང་བ་བསྒྲགས་ཞེས་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཅིག་ཤོས་སྣང་བའི་འོད་ཟེར་ཞེས་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དག་ཁྱེད་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་དུ་དེང་ལ་ངའི་ཚིག་གིས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ལ་སྙུན་མི་མངའ་འམ།
en: Then the Tathāgata Vimalateja­guṇa­rāja said to two bodhisattvas among his assembly, the bodhisattva Rahagarjita and a second bodhisattva named Jyotiraśmi, “Noble sons, go to the Sahā realm and with these words of mine ask the Tathāgata Śākyamuni about his health: ‘Are you well?

source: ཐུགས་བདེའམ།
en: Are you at ease?

source: བདེ་བར་རེག་པ་ལ་གནས་སམ་ཞེས་སྙུན་གསོལ་ཅིག །
en: Are you comfortable?’ ”

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་ཐམས་ཅད་དང་ལྡན་པའི་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་ས་དང་ནམ་མཁར་བཅས་པ་ཐམས་ཅད་བྱང་ཆུབ་སེམས་དཔའ་དག་གིས་ཁྱབ་པར་ཡང་དག་པར་རྗེས་སུ་མཐོང་སྟེ།
en: The bodhisattvas said, “Bhadanta Bhagavat, we have seen that in the entire Sahā buddha realm the ground and the sky are filled with bodhisattvas.

source: དེ་ནས་དང་ནམ་མཁའ་ལ་སེམས་ཅན་འགའ་ཙམ་གྱི་གོ་སྐབས་ཀྱང་མ་མཆིས་ན་བདག་ཅག་གང་དུ་གནས་པར་བགྱི་ལགས།
en: There is no room on the ground nor in the sky for even a few beings, so where would we sit?”

source: དེ་བཞིན་གཤེགས་པ་དྲི་མེད་གཟི་བརྗིད་ཡོན་ཏན་རྒྱལ་པོ་དེས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དག་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་ན་གོ་སྐབས་མེད་དོ་ཞེས་དེ་སྐད་མ་ཟེར་ཅིག །
en: The Tathāgata Vimalateja­guṇa­rāja said, “Noble sons, don’t say that there’s no room in the Sahā buddha realm.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why?

source: དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་ནི་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་བསམ་གྱིས་མི་ཁྱབ་པ་དག་གིས་གོ་སྐབས་ཡངས་པ་ཡིན་ཏེ་སྔོན་གྱི་སྨོན་ལམ་གྱིས་གསུམ་ལ་སྐྱབས་སུ་འགྲོ་བ་དང་།
en: Because the Tathāgata Śākyamuni provides a vast amount of room through the inconceivable qualities of buddhahood.

source: ཐེག་པ་གསུམ་གྱི་ཆོས་བསྟན་པ་ལས་བརྩམས་ཏེ་ཆོས་སྟོན་པར་མཛད་པ་དང་།
en: Through his previous prayers, he teaches the Dharma, beginning with refuge in the Three Jewels and the teaching of the three yānas.

source: བསླབ་པ་གསུམ་གྱི་སྡོམ་པ་སྟོན་པར་མཛད་པ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་པོ་དག་སྟོན་པར་མཛད་པ་དང་། སེམས་ཅན་རྣམས་ངན་སོང་གསུམ་པོ་དག་ལས་འདྲེན་པར་མཛད་པ་དང་།
en: He teaches the vows of the three trainings; he teaches the three doorways to liberation; he guides beings from the three lower existences; and he brings them onto the three peaceful paths.

source: ཞི་བའི་ལམ་གསུམ་པོ་དག་ལ་རབ་ཏུ་འགོད་པར་མཛད་པའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་དེའི་ཐུགས་རྗེ་དང་། བསྟན་པ་ལ་འཇུག་པ་ནི་ཡངས་པ་ཡིན་ནོ།
en: Therefore the Tathāgata’s compassion and the entry into his teaching are vast. “

source: །རིགས་ཀྱི་བུ་དག་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་རིང་པོ་མ་ལོན་པའི་དུས་ཤིག་ན་འདུལ་བའི་སེམས་ཅན་ལ་གཟིགས་ཤིང་རི་བྲག་མི་མཉམ་པའི་དབུས་ན་གནོད་སྦྱིན་དབང་པོ་མིག་ཅེས་བྱ་བའི་གནས་ཤིང་སཱ་ལའི་ཕུག་ན་རྣམ་པར་གྲོལ་བའི་དགའ་བ་དང་།
en: Noble sons, one time, not long after the Tathāgata Śākyamuni attained complete buddhahood, while contemplating the beings who were to be guided, he stayed in the hollow of a Sal tree that was the home of a yakṣa named Indrākṣa in the middle of a rugged, rocky mountain.

source: བདེ་བ་ཉམས་སུ་མྱོང་ཞིང་སྐྱིལ་མོ་ཀྲུང་གཅིག་གིས་ཞག་བདུན་ལས་འདའ་བར་མཛད་ཅིང་བཞུགས་པ་ན་དེ་བཞིན་གཤེགས་པའི་སྐུས་སཱ་ལའི་ཕུག་ཐམས་ཅད་ཁྱབ་པར་གྱུར་ཏེ།
en: For seven days he remained cross-legged, experiencing the joy and bliss of liberation.

source: དེ་ན་གང་དུ་དེ་བཞིན་གཤེགས་པའི་སྐུས་ཁྱབ་པར་མ་གྱུར་པའི་གོ་སྐབས་ནི་ཐ་ན་སོར་བཞི་ཙམ་གྱི་གཏོས་ཀྱང་མེད་དོ།
en: The Tathāgata’s body filled the tree hollow; there wasn’t even a four-finger-width space that was not filled by the Tathāgata’s body. “

source: །ཞག་བདུན་པོ་དེ་འདས་པ་དང་། ཕྱོགས་བཅུ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཁྲག་ཁྲིག་ཕྲག་བཅུ་གཉིས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་ལ་ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བ་དང་། ཆོས་མཉན་པའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་ཀྱི་རི་གང་ཡིན་པ་དེ་ལོགས་སུ་མངོན་དུ་ཕྱོགས་ཏེ་འཁོད་པ་དང་།
en: When seven days had passed, twelve hundred million bodhisattva mahāsattvas came from the ten directions to the Sahā realm and sat on the side of the mountain in order to pay homage to the Tathāgata Śākyamuni, attend upon him, and listen to his Dharma teaching. “

source: རིགས་ཀྱི་བུ་དག་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེས་འཁོར་དེར་རྫུ་འཕྲུལ་མངོན་པར་འདུ་བྱ་བ་མངོན་པར་འདུ་མཛད་པས་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་བཅུ་གཉིས་པོ་དེ་དག་གིས་སཱ་ལའི་ཕུག་གོ་སྐབས་ཡངས་པར་མཐོང་ཞིང་དེར་ཞུགས་པར་གྱུར་པ་དེ་ལྟར་སཱ་ལའི་ཕུག་དེ་ཡངས་པ་དང་དེ་ལྟར་རྒྱ་ཆེ་བར་གྱུར་ཏོ།
en: Noble sons, the Tathāgata Śākyamuni performed a miraculous transformation for that assembly. The tree hollow became vast and wide. When the twelve hundred million bodhisattvas entered the tree hollow, they saw it as vastly spacious.

source: །དེར་བྱང་ཆུབ་སེམས་དཔའ་རེ་རེས་ཀྱང་དེ་བཞིན་གཤེགས་པ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་འཕྲུལ་པ་སྣ་ཚོགས་དག་གིས་མཆོད་པ་བྱས་ནས།
en: Each bodhisattva manifested a variety of bodhisattva miracles so as to make offerings to the Tathāgata.

source: དེར་བྱང་ཆུབ་སེམས་དཔའ་རེ་རེས་ཀྱང་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཁྲི་སྟན་དག་མངོན་པར་སྤྲུལ་ནས་དེ་ལ་འཁོད་དེ་ཆོས་ཉན་པར་བྱེད་དོ།
en: Then each bodhisattva manifested a seat made of seven jewels and sat upon it to listen to the Dharma. “

source: །རིགས་ཀྱི་བུ་དག་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་ཀྱང་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ལས་ཆོས་མཉན་ཏེ། དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པའི་ཞབས་ལ་ལན་གསུམ་མགོ་བོས་ཕྱག་བྱས་ནས་རང་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་དག་ཏུ་དོང་ངོ་།
en: Noble sons, when those bodhisattvas had heard the Dharma from the Tathāgata Śākyamuni, they bowed their heads three times to the Tathāgata Śākyamuni’s feet and returned to their own buddha realms.

source: །བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དོང་ནས་རིང་པོ་མ་ལོན་པར་སཱ་ལའི་ཕུག་དེ་ཡང་སྔོན་ཇི་ལྟ་བ་བཞིན་དུ་གྱུར་ཏེ།
en: As soon as those bodhisattvas departed, the tree hollow became just as it was before.

source: དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་ནི་དེ་ལྟར་གོ་སྐབས་ཡངས་པ་ཡིན་ནོ།
en: The Tathāgata Śākyamuni can create that kind of vast space. “

source: །གླིང་བཞི་པ་དེ་ན་བརྒྱ་བྱིན་ཀཽ་ཤི་ཀ་ཞེས་བྱ་བ་ཚེ་ཡོངས་སུ་ཟད་དེ་དུད་འགྲོའི་སྐྱེ་གནས་སུ་སྐྱེ་བས་འཇིགས་ཤིང་སྐྲག་ནས་དེ་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷའི་བུ་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་ལྷན་ཅིག་འགྲོགས་ཏེ་སཱ་ལའི་ཕུག་ག་ལ་བ་དང་།
en: In that four-continent world, there was a Śakra named Kauśika, whose life was nearing its end, and he was afraid of being reborn as an animal. Accompanied by 84,000 deities of the Trāyastriṃśa paradise, he went to the tree hollow where the Bhagavat was.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ཕྱིན་ནས་གནོད་སྦྱིན་དབང་པོ་མིག་གི་གནས་སཱ་ལའི་ཕུག་གི་ཁོ་ར་ཁོར་ཡུག་ཏུ་འཁོད་པ་དང་།
en: When they arrived, they sat beside the tree hollow that was the home of the yakṣa Indrākṣa.

source: བཅོམ་ལྡན་འདས་ཀྱི་མཐུས་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། གང་བདག་གིས་དྲི་ཟའི་བུ་གཙུག་ཕུད་ལྔ་པ་ལ་གསོལ་བ་བཏབ་སྟེ།
en: Kauśika, through the power of the Bhagavat, thought, ‘I should make a request to the gandharva Pañcaśikha.

source: དྲི་ཟའི་བུ་གཙུག་ཕུད་ལྔ་པ་དེས་དབྱངས་སྙན་པས་བཅོམ་ལྡན་འདས་ལ་མངོན་སུམ་དུ་བསྟོད་ན་ནི་དེའི་ཚེ། བཅོམ་ལྡན་འདས་བསམ་གཏན་དང་། ཏིང་ངེ་འཛིན་དག་ལས་བཞེངས་པར་འགྱུར་རོ་སྙམ་ནས།
en: When the gandharva Pañcaśikha sings beautiful praises to the Bhagavat, the Bhagavat comes out from his dhyānas and samādhis.’ “

source: དེ་ནས་བརྒྱ་བྱིན་ཀཽ་ཤི་ཀས་དྲི་ཟའི་བུ་གཙུག་ཕུད་ལྔ་པ་ལ་གསོལ་བ་བཏབ་བོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་མཐུས་དྲི་ཟའི་བུ་གཙུག་ཕུད་ལྔ་པས་པི་བང་བླངས་ཏེ། གླུ་དང་རོལ་མོའི་སྒྲ་ཡིད་དུ་འོང་བས་བཅོམ་ལྡན་འདས་ལ་བསྟོད་པ་ལྔ་བརྒྱས་བསྔགས་པ་བརྗོད་དོ།
en: Then Śakra Kauśika made that request to the gandharva Pañcaśikha, and the gandharva Pañcaśikha picked up his lute and, through the power of the Bhagavat, in music and song he praised the Bhagavat with five hundred eulogies.

source: །རིགས་ཀྱི་བུ་དག་གང་གི་ཚེ་དྲི་ཟའི་བུ་གཙུག་ཕུད་ལྔ་པས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་བསྟོད་པ་བརྩམས་པ་དང་། དེ་ནས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་དེ་དབྱངས་སྙན་རྣམ་པར་སྣང་བྱེད་ཏོག་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་སོ། །ཏིང་ངེ་འཛིན་དེས་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་ན་གང་དག་རྫུ་འཕྲུལ་ཆེ་བའི་གནོད་སྦྱིན་རྣམས་དང་། སྲིན་པོ་རྣམས་དང་། ལྷ་མ་ཡིན་རྣམས་དང་། ནམ་མཁའ་ལྡིང་རྣམས་དང་།
en: Noble sons, when the gandharva Pañcaśikha began to praise the Bhagavat, the Tathāgata Śākyamuni, on hearing the song, entered the samādhi called the crest ornament that illuminates beautiful songs.

source: མིའམ་ཅི་རྣམས་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་རྣམས་དང་། དྲི་ཟ་རྣམས་དང་། འདོད་པ་ན་སྤྱོད་པའི་ལྷའི་བུ་ཐམས་ཅད་དང་། གཟུགས་ན་སྤྱོད་པའི་ལྷའི་བུ་ཐམས་ཅད་དེར་འདུས་པར་གྱུར་ནས།
en: Through that samādhi, powerful yakṣas, rākṣasas, asuras, garuḍas, kinnaras, mahoragas, gandharvas, all the desire-realm devas, and all the form-realm devas in the Sahā realm came to that place.

source: གང་དག་དབྱངས་ལ་དད་པ་དེ་དག་གིས་ནི་དབྱངས་ཐོས་ནས་རབ་ཏུ་དང་བར་གྱུར་ཏོ། །གང་དག་བསྔགས་པ་དང་སྙན་པ་ལ་དགའ་བ་དེ་དག་གིས་ནི་བཅོམ་ལྡན་འདས་ཀྱི་བསྔགས་པ་ཐོས་ནས་བཅོམ་ལྡན་འདས་དེ་ལ་ཤིན་ཏུ་དགའ་བ་དང་། རབ་ཏུ་དང་བ་དང་། བླ་མར་བྱ་བ་དང་། རི་མོར་བྱ་བ་དང་།
en: Those who liked to listen to music heard music, those who liked listening to beautiful praises heard praises, and in the presence of the Bhagavat they felt powerful happiness, joy, delight, and veneration and respect for the teacher.

source: གུས་པ་སྐྱེས་ཏེ་རབ་ཏུ་དང་བར་གྱུར་ཏོ། །གང་དག་གླིང་བུའི་སྒྲ་ལ་དགའ་བ་དེ་དག་གིས་གླིང་བུའི་སྒྲ་ཐོས་ནས་རབ་ཏུ་དང་བར་གྱུར་ཏོ།
en: Those who liked listening to flute music heard a flute. “

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་ཏིང་ངེ་འཛིན་དེ་ལས་བཞེངས་ཏེ་སཱ་ལའི་ཕུག་གི་སྒོར་གཟིགས་པ་དང་།
en: The Tathāgata Śākyamuni then arose from that samādhi and looked out from the tree hollow.
